run/tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/constant/floor/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       off;

radiationModel  none;//opaqueSolid;

absorptionEmissionModel none;

multiBandAbsorptionEmissionCoeffs
{
    absorptivity    (0.3 0.7);
    emissivity      (0.3 0.7);
}

scatterModel    none;

sootModel none;


// ************************************************************************* //
